import 'Classes.dart';

final List<Catogory> cats = [
  Catogory(id: "asfasfadf", image: "img/Cats/1.jpg", title: "زلاطة"),
  Catogory(id: "asfasf", image: "img/Cats/2.jpg", title: "بيتزا"),
  Catogory(id: "asfasfadfasfadf", image: "img/Cats/3.jpg", title: "مقبلات"),
  Catogory(id: "asfasaSerfadf", image: "img/Cats/4.jpg", title: "هامبركر"),
  Catogory(id: "asfasasdasfdfadf", image: "img/Cats/5.jpg", title: "كباب"),
];
List<Products> prod = [
  Products(
      categoryID: "asfasfadf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "ascat1",
      price: 15000,
      sale: 0,
      title: "زلاطة 1",
      images: ["img/Cats/1.jpg"]),
  Products(
      categoryID: "asfasfadf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "ascat2",
      price: 15000,
      sale: 0,
      title: "زلاطة 2",
      images: ["img/Cats/3.jpg"]),
  Products(
      categoryID: "asfasf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "aspit1",
      price: 15000,
      sale: 0,
      title: "بيتزا 1",
      images: ["img/pitzz/1.jpg"]),
  Products(
      categoryID: "asfasf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "aspit2",
      price: 15000,
      sale: 0,
      title: "بيتزا 2",
      images: ["img/pitzz/2.jpg"]),
  Products(
      categoryID: "asfasfadfasfadf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "asmuq1",
      price: 15000,
      sale: 0,
      title: "مقبلات 1",
      images: ["img/Muqablat/1.jpg"]),
  Products(
      categoryID: "asfasfadfasfadf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "asmuq2",
      price: 15000,
      sale: 0,
      title: "مقبلات 2",
      images: ["img/Muqablat/2.jpg"]),
  Products(
      categoryID: "asfasaSerfadf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "asbur1",
      price: 15000,
      sale: 0,
      title: "بركر 1",
      images: ["img/Burgger/0.jpg"]),
  Products(
      categoryID: "asfasaSerfadf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "asbur2",
      price: 15000,
      sale: 0,
      title: "بركر 2",
      images: ["img/Burgger/1.jpg"]),
  Products(
      categoryID: "asfasasdasfdfadf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "askab1",
      price: 15000,
      sale: 0,
      title: "كباب 1",
      images: ["img/Kabab/1.jpg"]),
  Products(
      categoryID: "asfasasdasfdfadf",
      date: DateTime.now(),
      description:
          "عندما يريد العالم أن ‪يتكلّم ‬ ، فهو يتحدّث بلغة يونيكود. تسجّل الآن لحضور المؤتمر الدولي العاشر ليونيكود ، الذي سيعقد في 10-12 آذار 1997 بمدينة مَايِنْتْس، ألمانيا. و سيجمع المؤتمر بين خبراء من كافة قطاعات الصناعة على الشبكة العالمية انترنيت ويونيكود، حيث ستتم، على الصعيدين الدولي والمحلي على حد سواء مناقشة سبل استخدام يونكود في النظم القائمة وفيما يخص التطبيقات الحاسوبية، الخطوط، تصميم النصوص والحوسبة متعددة اللغات.",
      id: "askab2",
      price: 15000,
      sale: 0,
      title: "كباب 2",
      images: ["img/Kabab/2.jpg"]),
];
List<CartItem> cart = [];
